# SetServicePaletteExclusions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..SetServicePaletteExclusions Method
FabricationService Class See Also
---
Sets the service palette exclusions, used by Route and Fill or Design to Fabrication commands, for the current user and session only. This will alter them from the default configuration exclusions to only exclude those palettes passed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool SetServicePaletteExclusions(
	IList<int> excludedPalettes
)
```

Visual Basic
---
```text
Public Function SetServicePaletteExclusions ( _
	excludedPalettes As IList(Of Integer) _
) As Boolean
```

Visual C++
---
```text
public:
bool SetServicePaletteExclusions(
	IList<int>^ excludedPalettes
)
```

# ### Parameters
excludedPalettes
    Type: System.Collections.Generic..::..IList<(Of <(<'Int32>)>)> A list of service palette indexes to be excluded.
# ### Return Value
Returns true if succeeded to set the exclusions to the specified palette(s).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Palette indices contains an index that is not larger or equal to 0 and less than PaletteCount. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace